_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 65, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 61, 316, 6)        456       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 30, 158, 6)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 26, 154, 6)        906       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 13, 77, 6)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6006)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 120)               720840    
_________________________________________________________________
dense_2 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 85        
=================================================================
Total params: 732,451
Trainable params: 732,451
Non-trainable params: 0
_________________________________________________________________
